wfhit/synapse_pilot/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
	if (count == 0) {
		return OK;
	}

	/* Construct I2C address for FIFO access */
	i2c_addr = WK2132_MAKE_I2C_ADDR(priv->base_addr, priv->port, true);

	/* Single I2C write transaction for all bytes */
	msg.frequency = WK2132_I2C_FREQUENCY;
	msg.addr      = i2c_addr;
	msg.flags     = 0;
	msg.buffer    = (FAR uint8_t *)buffer;
	msg.length    = count;

	ret = I2C_TRANSFER(priv->i2c, &msg, 1);
	return (ret >= 0) ? OK : ret;
}

/**
 * @brief Set baud rate for a UART port
 * Based on DFRobot implementation with fractional calculation
 */
static int wk2132_set_baud(FAR struct wk2132_dev_s *priv, uint32_t baud)
{
	uint16_t val_integer, val_decimal;
	uint8_t baud1, baud0, pres;
	int ret;

	syslog(LOG_DEBUG, "WK2132: Setting baud rate to %lu\n", (unsigned long)baud);

	/* DFRobot algorithm:
	 * val_integer = FOSC/(baud * 16) - 1
	 * val_decimal = (FOSC%(baud * 16))/(baud * 16) * 10 (for prescaler calculation)
	 * Prescaler is calculated from decimal part
	 */
	val_integer = (WK2132_CRYSTAL_FREQ / (baud * 16)) - 1;
	/* Calculate decimal part more accurately by scaling */
	uint32_t remainder = WK2132_CRYSTAL_FREQ % (baud * 16);
	val_decimal = (remainder * 10) / (baud * 16);

	/* Extract high and low bytes */
	baud1 = (uint8_t)(val_integer >> 8);
	baud0 = (uint8_t)(val_integer & 0x00FF);

	/* Calculate prescaler from decimal part */
	while (val_decimal > 0x0A) {
		val_decimal /= 0x0A;
	}

	pres = (uint8_t)val_decimal;

	/* Select sub-page 1 for baud rate configuration */
	ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 1);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to switch to sub-page 1 for port %d: %d\n", priv->port, ret);
		return ret;
	}

	/* Set baud rate registers */
	ret = wk2132_i2c_write_reg(priv, WK2132_BAUD1, baud1);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write BAUD1 register for port %d: %d\n", priv->port, ret);
		return ret;
	}

	ret = wk2132_i2c_write_reg(priv, WK2132_BAUD0, baud0);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write BAUD0 register for port %d: %d\n", priv->port, ret);
		return ret;
	}

	ret = wk2132_i2c_write_reg(priv, WK2132_PRES, pres);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write PRES register for port %d: %d\n", priv->port, ret);
		return ret;
	}

	/* Read back the baud rate registers for verification */
	uint8_t verify_reg;
	/* Simple verification - just check if we can read back any register to ensure I2C communication is working */
	ret = wk2132_i2c_read_reg(priv, WK2132_BAUD1, &verify_reg);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to verify baud rate registers for port %d: %d\n", priv->port, ret);
		goto errout;
	}

	/* Return to sub-page 0 */
	ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 0);

	if (ret < 0) {
		return ret;
	}

	syslog(LOG_DEBUG, "WK2132: Baud rate %lu set successfully\n", (unsigned long)baud);

	return OK;

errout:
	/* Try to restore state on error */
	wk2132_i2c_write_reg(priv, WK2132_SPAGE, 0);  /* Return to page 0 */
	return ret;
}

/**
 * @brief Reconfigure UART port settings without disrupting polling
 * This function safely updates port settings while preserving enabled state
 */
static int wk2132_reconfigure(FAR struct uart_dev_s *dev)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
	uint8_t lcr = 0;
	int ret;
	bool was_enabled;

	syslog(LOG_INFO, "WK2132: Reconfiguring port %d\n", priv->port);

	/* Take exclusive access */
	ret = nxsem_wait(&priv->exclsem);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to get exclusive access for port %d\n", priv->port);
		return ret;
	}

	/* Save and temporarily disable port to prevent data loss during reconfiguration */
	was_enabled = priv->enabled;
	priv->enabled = false;

	/* Configure LCR based on new settings */
	if (priv->stopbits2) {
		lcr |= WK2132_LCR_STB;  /* 2 stop bits */
	}

	/* Configure parity according to datasheet and termios standards */
	switch (priv->parity) {
	case 0:  /* No parity */
		/* PAEN=0, no parity bits needed */
		break;

	case 1:  /* Odd parity */
		lcr |= WK2132_LCR_PAEN | WK2132_LCR_PAM0;  /* Enable parity, PAM1=0,PAM0=1 for odd */
		break;

	case 2:  /* Even parity */
		lcr |= WK2132_LCR_PAEN | WK2132_LCR_PAM1;  /* Enable parity, PAM1=1,PAM0=0 for even */
		break;

	default:
		syslog(LOG_WARNING, "WK2132: Invalid parity mode %lu, using no parity\n", (unsigned long)priv->parity);
		break;
	}

	ret = wk2132_i2c_write_reg(priv, WK2132_LCR, lcr);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write LCR register for port %d\n", priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Set LCR=0x%02x for port %d\n", lcr, priv->port);

	/* Set baud rate */
	ret = wk2132_set_baud(priv, priv->baud);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to set baud rate %lu for port %d\n", (unsigned long)priv->baud, priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Set baud rate %lu for port %d\n", (unsigned long)priv->baud, priv->port);

	/* Allow configuration to settle */
	usleep(10000);  /* 10ms delay */

	syslog(LOG_INFO, "WK2132: Reconfiguration completed successfully for port %d\n", priv->port);

	/* Restore enabled state */
	priv->enabled = was_enabled;

errout:

	/* Restore enabled state on error too */
	if (ret < 0) {
		priv->enabled = was_enabled;
	}

	nxsem_post(&priv->exclsem);
	return ret;
}

/**
 * @brief Polling worker function
 *
 * RX path: reads RFCNT to check byte count, then does a single bulk I2C
 * FIFO read into a per-port staging buffer.  uart_recvchars() is called
 * afterwards; its rxavailable()/receive() callbacks pull from the staging
 * buffer with zero I2C — safe even if the NuttX serial framework calls
 * them from a critical section.
 *
 * TX path: first flushes any data in the TX staging ring buffer to the
 * WK2132 TX FIFO via a single bulk I2C write, then calls uart_xmitchars()
 * to refill the staging buffer via send()/txready() — also zero I2C.
 */
static void wk2132_poll_worker(FAR void *arg)
{
	int i;
	int device_count;
	bool should_continue;

	/* Snapshot device count under lock to avoid racing with setup */
	nxsem_wait(&g_wk2132_poll_sem);
	device_count = g_wk2132_device_count;
	nxsem_post(&g_wk2132_poll_sem);

	/* Poll all registered devices */
	for (i = 0; i < device_count; i++) {
		FAR struct uart_dev_s *dev = g_wk2132_devices[i];

		if (dev != NULL) {
			FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

			/* Only poll enabled devices */
			if (priv->enabled) {
				/* --- RX: drain staging buffer, then read new FIFO data --- */

				/* If staging has unconsumed data (e.g. NuttX recv buffer
				 * was full last time), try to drain it first. */
				if (priv->rx_staging_pos < priv->rx_staging_count) {
					uart_recvchars(dev);
				}

				/* Read new FIFO data only when staging is fully consumed */
				if (priv->rx_staging_pos >= priv->rx_staging_count) {
					uint8_t rfcnt = 0;

					if (wk2132_i2c_read_reg(priv, WK2132_RFCNT, &rfcnt) >= 0) {
						uint16_t rx_count = rfcnt;

						/* RFCNT is 8-bit; a full 256-byte FIFO wraps to 0.
						 * Detect this by checking FSR.RDAT when count is 0. */
						if (rx_count == 0) {
							uint8_t fsr = 0;

							if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) >= 0
							    && (fsr & WK2132_FSR_RDAT)) {
								rx_count = WK2132_FIFO_SIZE;
							}
						}

						if (rx_count > 0) {
							if (wk2132_i2c_read_fifo_bulk(priv, priv->rx_staging, rx_count) >= 0) {
								priv->rx_staging_count = rx_count;
								priv->rx_staging_pos = 0;
								uart_recvchars(dev);
							}
						}
					}
				}

