wfhit/synapse_pilot/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
				/* --- TX: refill staging from NuttX xmit buffer first --- */
				if (priv->txint_enabled && dev->xmit.head != dev->xmit.tail) {
					uart_xmitchars(dev);
				}

				/* --- TX: flush staging ring buffer to WK2132 TX FIFO --- */
				uint16_t tx_head = priv->tx_staging_head;
				uint16_t tx_tail = priv->tx_staging_tail;

				if (tx_head != tx_tail) {
					uint16_t tx_count;

					if (tx_head > tx_tail) {
						tx_count = tx_head - tx_tail;
					} else {
						tx_count = WK2132_FIFO_SIZE - tx_tail;
					}

					uint8_t tfcnt = 0;

					if (wk2132_i2c_read_reg(priv, WK2132_TFCNT, &tfcnt) >= 0) {
						uint16_t space = WK2132_FIFO_SIZE - (uint16_t)tfcnt;

						if (tfcnt == 0) {
							uint8_t fsr = 0;

							if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) >= 0
							    && (fsr & WK2132_FSR_TFULL)) {
								space = 0;
							}
						}

						if (tx_count > space) {
							tx_count = space;
						}

						if (tx_count > 0) {
							wk2132_i2c_write_fifo_bulk(priv,
										   &priv->tx_staging[tx_tail],
										   tx_count);
							priv->tx_staging_tail = (tx_tail + tx_count)
										& (WK2132_FIFO_SIZE - 1);
						}
					}
				}
			}
		}
	}

	/* Check if we should continue polling (with proper synchronization) */
	nxsem_wait(&g_wk2132_poll_sem);
	should_continue = g_wk2132_poll_started;
	nxsem_post(&g_wk2132_poll_sem);

	/* Schedule next poll */
	if (should_continue) {
		work_queue(LPWORK, &g_wk2132_poll_work, wk2132_poll_worker, NULL,
			   MSEC2TICK(1));
	}
}

/**
 * @brief Setup UART port
 * Based on DFRobot subSerialConfig implementation
 */
static int wk2132_setup(FAR struct uart_dev_s *dev)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
	uint8_t lcr = 0;
	uint8_t gena, grst;
	int ret;

	syslog(LOG_INFO, "WK2132: Setting up port %d\n", priv->port);

	/* Take exclusive access */
	ret = nxsem_wait(&priv->exclsem);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to get exclusive access for port %d\n", priv->port);
		return ret;
	}

	/* Step 1: Sub UART clock enable (DFRobot: subSerialGlobalRegEnable(subUartChannel, clock)) */
	syslog(LOG_DEBUG, "WK2132: Sub UART clock enable for port %d\n", priv->port);

	/* Acquire global semaphore to protect GENA read-modify-write */
	nxsem_wait(&g_wk2132_poll_sem);
	ret = wk2132_i2c_read_global(priv, WK2132_GENA, &gena);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to read GENA register for port %d\n", priv->port);
		nxsem_post(&g_wk2132_poll_sem);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Current GENA=0x%02x for port %d\n", gena, priv->port);

	/* Enable the UART port in global register */
	uint8_t gena_bit = 1 << (priv->port - 1);
	gena |= gena_bit;
	ret = wk2132_i2c_write_global(priv, WK2132_GENA, gena);
	nxsem_post(&g_wk2132_poll_sem);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write GENA register for port %d\n", priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Enabled clock for port %d in GENA, new value=0x%02x\n", priv->port, gena);

	/* Allow clock to stabilize */
	usleep(50000);  /* 50ms delay */

	/* Step 2: Software reset sub UART (DFRobot: subSerialGlobalRegEnable(subUartChannel, rst)) */
	syslog(LOG_DEBUG, "WK2132: Software reset sub UART for port %d\n", priv->port);

	/* Acquire global semaphore to protect GRST read-modify-write */
	nxsem_wait(&g_wk2132_poll_sem);
	ret = wk2132_i2c_read_global(priv, WK2132_GRST, &grst);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to read GRST register for port %d\n", priv->port);
		nxsem_post(&g_wk2132_poll_sem);
		goto errout;
	}

	uint8_t grst_bit = 1 << (priv->port - 1);
	grst |= grst_bit;
	ret = wk2132_i2c_write_global(priv, WK2132_GRST, grst);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write GRST register for port %d\n", priv->port);
		nxsem_post(&g_wk2132_poll_sem);
		goto errout;
	}

	/* Allow reset to complete */
	usleep(10000);  /* 10ms delay */

	/* Clear reset bit to deassert reset */
	grst &= ~grst_bit;
	ret = wk2132_i2c_write_global(priv, WK2132_GRST, grst);
	nxsem_post(&g_wk2132_poll_sem);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to clear GRST for port %d\n", priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Reset completed for port %d\n", priv->port);

	usleep(10000);  /* 10ms settle */

//  /* Step 3: Sub UART global interrupt enable (DFRobot: subSerialGlobalRegEnable(subUartChannel, intrpt)) */
//  syslog(LOG_DEBUG, "WK2132: Sub UART global interrupt enable for port %d\n", priv->port);
//  ret = wk2132_i2c_read_global(priv, WK2132_GIER, &gier);
//  if (ret < 0)
//    {
//      syslog(LOG_ERR, "WK2132: Failed to read GIER register for port %d\n", priv->port);
//      goto errout;
//    }
//
//  uint8_t gier_bit = 1 << (priv->port - 1);
//  gier |= gier_bit;
//  ret = wk2132_i2c_write_global(priv, WK2132_GIER, gier);
//  if (ret < 0)
//    {
//      syslog(LOG_ERR, "WK2132: Failed to write GIER register for port %d\n", priv->port);
//      goto errout;
//    }
//
//  syslog(LOG_DEBUG, "WK2132: Global interrupt enabled for port %d, GIER=0x%02x\n", priv->port, gier);
//
//  /* Allow interrupt configuration to settle */
//  usleep(25000);  /* 25ms delay */

	/* Step 4: Sub UART page register setting (default PAGE0) */
	syslog(LOG_DEBUG, "WK2132: Sub UART page register setting (default PAGE0) for port %d\n", priv->port);
	ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 0);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to set page 0 for port %d\n", priv->port);
		goto errout;
	}

//  /* Step 5: Sub interrupt setting - Enable multiple interrupt sources like DFRobot */
//  syslog(LOG_DEBUG, "WK2132: Sub interrupt setting for port %d\n", priv->port);
//  uint8_t sier = WK2132_SIER_RFTRIG_IEN |   /* RX FIFO trigger interrupt */
//                 WK2132_SIER_RXOUT_IEN |    /* RX timeout interrupt */
//                 WK2132_SIER_TFTRIG_IEN |   /* TX FIFO trigger interrupt */
//                 WK2132_SIER_TFEMPTY_IEN |  /* TX FIFO empty interrupt */
//                 WK2132_SIER_FERR_IEN;      /* Frame error interrupt */
//
//  ret = wk2132_i2c_write_reg(priv, WK2132_SIER, sier);
//  if (ret < 0)
//    {
//      syslog(LOG_ERR, "WK2132: Failed to write SIER register for port %d\n", priv->port);
//      goto errout;
//    }
//
//  syslog(LOG_DEBUG, "WK2132: Set SIER=0x%02x for port %d\n", sier, priv->port);

	/* Step 6: Enable transmit/receive FIFO with reset (DFRobot style) */
	syslog(LOG_DEBUG, "WK2132: Enable transmit/receive FIFO for port %d\n", priv->port);

	/* DFRobot FCR configuration: {.rfRst = 0x01, .tfRst = 0x00, .rfEn = 0x01, .tfEn = 0x01, .rfTrig = 0x00, .tfTrig = 0x00} */
	uint8_t fcr_current = 0;

